# ğŸ” SystÃ¨me Expert en Prolog â€“ EnquÃªte PoliciÃ¨re

Ce projet est un petit systÃ¨me expert Ã©crit en **Prolog** permettant de :
- DÃ©finir diffÃ©rents types de crimes (`vol`, `assassinat`, `escroquerie`).
- Associer des preuves Ã  des suspects (mobile, empreintes, ADN, alibi...).
- DÃ©terminer automatiquement si un suspect est **coupable** ou **non coupable**.
- Calculer un **niveau de suspicion** (score de 0 Ã  100).
- Garder un **historique des enquÃªtes**.

---

## ğŸš€ FonctionnalitÃ©s

- VÃ©rification de culpabilitÃ© via la rÃ¨gle `is_guilty/2`.
- Calcul du **niveau de suspicion** avec `suspicion_level/3`.
- Interface simple en ligne de commande avec la prÃ©dicat `main/0`.
- Historique consultable avec `show_history/0`.

---

## ğŸ“‚ Structure

- `crime_type/1` : DÃ©finit les crimes.
- `suspect/1` : Liste les suspects.
- `has_motive/2`, `has_dna_evidence/2`, etc. : Preuves liÃ©es aux suspects.
- `is_guilty/2` : VÃ©rifie si un suspect est coupable.
- `suspicion_level/3` : Calcule le score de suspicion.
- `record_investigation/3` : Stocke lâ€™historique.
- `show_history/0` : Affiche les enquÃªtes passÃ©es.

---

## ğŸ› ï¸ Utilisation

1. **Lancer SWI-Prolog**
   ```bash
   swipl

2. **Charger le programme**
?- [enquetePoliciere].

3. **Taper le commande**
?- main.

4. **Commencer l'enquÃªte**
Entrez une requÃªte (ex: crime(john, vol)) ou "stop" pour quitter:
|: crime(john, vol).
john est coupable de vol.
Niveau de suspicion: 80%.

5. **Consulter lâ€™historique des enquÃªtes**
?- show_history.


## ğŸ“Š Exemple de sortie
?- crime(mary, assassinat).
mary est coupable de assassinat.
Niveau de suspicion: 100%.

?- crime(sophie, escroquerie).
sophie n'est pas coupable de escroquerie.

?- show_history.
Historique des enquÃªtes:
john - vol: coupable
mary - assassinat: coupable
sophie - escroquerie: non_coupable